[
    {
        "title": "NIVEA UV Face Shine Control Cream SPF 50 - 50ml",
        "slug": "nivea-uv-face-shine-control-cream-spf-50-50ml",
        "price_ksh": "KSh 975",
        "price": 7.52,
        "image": "products/5572_b.jpg",
        "brand": "NIVEA",
        "category": "Health & Beauty",
        "description": "NIVEA SUNUV Face Shine Control Cream provides highly effective and immediate UVA/UVB protection against sunburn and premature skin aging.NIVEA SUN UV Face Shine Control SPF 50 is especially developed for delicate facial skin. Formula with Ultra Spectrum Protection provides immediate protection against UVA & UVB induced skin damage as well as from High Energy Visible Lights effects such as premature skin aging.The light and non-greasy formula provides an instant and long-lasting mattifying effect. Developed for normal/combination skin types. Ideal for every day use, the formula is ophthalmologically approved (aka eye friendly) and skin compatibility is dermatologically approved. NIVEA SUN aims to minimize the impact on the environment. The Ocean Respect formula is free of UV filters Octinoxate, Oxybenzone & Octocrylene.The new and improved formulations respect the reef by being free from UV filters Octinoxate and Oxybenzone. The box is made from FSC Mix Certified cardboard. UV Face is available for normal/combination, normal/dry, sensitive and normal skin types. Protection for everyone with NIVEA SUN Adults and Kids.KEY PRODUCT FEATURESProvides protection against sunburn and premature skin aging.Eye friendly, ophthalmologically proven,Instant and long-lasting mattifying effect.Non-greasy, non-sticky formula and leaves a light feeling on your skin.INGREDIENTSAqua, Homosalate, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Triazone, Butylene Glycol Dicaprylate/Dicaprate, Alcohol Denat., Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Phenylbenzimidazole Sulfonic Acid, Silica, Cyclomethicone, Tapioca Starch, Behenyl Alcohol, Cetearyl Alcohol, Methylpropanediol, Glycer in, Glycyrrhiza Inflata Root Extract, Tocopheryl Acetate, Sodium Stearoyl Glutamate, Isomethyl Ionone, Geraniol, Citronellol, Coumarin, Parfum",
        "sku": ": NI534ST1ECR8ONAFAMZ",
        "specifications": {
            "SKU": ": NI534ST1ECR8ONAFAMZ",
            "Weight (kg)": ": 500ml",
            "Main Material": ": -",
            "From the Manufacturer": ": <font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\">​</font></font>",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [
            "products/5572_d.jpg",
            "products/5578_a.jpg",
            "products/5583_a.jpg",
            "products/5587_a.jpg",
            "products/5594_a.jpg",
            "products/5601_a.jpg",
            "products/5609_a.jpg",
            "products/5616_a.jpg"
        ],
        "stock": 55,
        "reviews": "4.3 out of 5(5721)"
    },
    {
        "title": "Garnier Vitamin C Booster Serum 30ml Twin Pack",
        "slug": "garnier-vitamin-c-booster-serum-30ml-twin-pack",
        "price_ksh": "KSh 3,500",
        "price": 26.98,
        "image": "products/6191.jpg",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "One is not enough, get two Vitamin C serums.GarnierVitamin C Anti-Dark Spot Serum is enriched with a potent mix of[3.5%] Vitamin C*, Niacinamide & Salicylic Acid, to reduce the appearance of dark spots and enhance glow, along with Lemon Extract, a powerful superfood well known for its brightening properties. The formula has been carefully blended to provide dark-spot action without being heavy or greasy on the skin.How To Use:1. Cleanse your face with Garnier Even and Matte Cleansing Foam and pat dry.2. Take a pea sized amount of the Vitamin C Booster Serum in your palms. Spread it between your palms without rubbing too much.3. Dab the serum all over your face and neck using small and gentle tapping motions.4. Follow up with the Garnier Even and Matte Vitamin C Protection Cream SPF30. For best results, use daily.",
        "sku": ": GA297ST1QK1H2NAFAMZ",
        "specifications": {
            "SKU": ": GA297ST1QK1H2NAFAMZ",
            "Weight (kg)": ": 0.6",
            "From the Manufacturer": ": <font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\">​</font></font>",
            "Care Label": ": Avoid eye area. In case of contact with eyes, rinse immediately and thoroughly.",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/6191_b.jpg",
            "products/8410_a.jpg",
            "products/8410_c.jpg",
            "products/8410_e.jpg",
            "products/6191_d.jpg",
            "products/8410_g.jpg",
            "products/8410_i.jpg",
            "products/8410_k.jpg"
        ],
        "stock": 32,
        "reviews": "4.4 out of 5(1090)"
    },
    {
        "title": "Vitron HTC4388FS - 43\" Smart  Android Frameless TV - Black (1YR WRTY)",
        "slug": "vitron-htc4388fs-43-smart-android-frameless-tv-black-1yr-wrty",
        "price_ksh": "KSh 18,499",
        "price": 142.63,
        "image": "products/2981.jpg",
        "brand": "Vitron",
        "category": "Electronics",
        "description": "If you are looking for an all-in one TV that saves power at the same time, then43\" Smart FRAMELESS TV HTC4388FS FRAMELESS TV - Black(BLUETOOTH) is your BEST choice. It hasFull High Definition(HD) video resolution and WiFi-enabled making it amazing for movie lovers who prefer streaming through popular Apps like YouTube and Netflix. Running on android 7.0, our Smart Module allows you to enjoy a customized browser and enjoy Optimized Connectivity  with 2 USB ports and 3 HDMI ports. With Vision Plus care warranty we have you covered for 1 year.Connectivity43\" Smart FRAMELESS TV HTC4388FS FRAMELESS TV - Black  has a powerful stream media that helps you read the audio and video files in your mobile devices at anytime. You can also browse your fascinating photos while enjoying music. Our TV has powerful identification and reading functions, providing much better choice for you.Energy Saving FeatureThis TV is ENERGY STAR-qualified which prevent greenhouse gas emissions by meeting strict energy efficiency guidelines set by the U.S. Environmental Protection Agency and the U.S. Department of Energy. The ENERGY STAR name and marks are registered marks owned by the U.S. government, as part of their energy efficiency and environmental activities.Stunning pictures, incredible valueExperience stunning HD picture quality with more than for breath-taking colour, clarity and contrast. Watch selected movies and TV shows come to life in Ultra HD. Vitron Smart is built for speed and performance. Connect easily with built-in Wi-Fi, four HDMI inputs, and multiple input/output options.Plus, your TV keeps getting better with over-the-air software updates, so you always have the latest software installed.Endless entertainment optionsWatch live TV, stream movies, enjoy the best of Netflix and YouTube videos at the click of your remote. Easily download more games and streaming apps from the Android App Store.Technical SpecificationsDisplay43″ ScreenMain FeaturesFull HDDigital DVB-T2 Free to AirRecord to USBAndroid 7ConnectivityHDMI input1 PC audio‎ in/Earphones2 USB1 VGA AV RF Features Digital DVB‎T2 Free to Air USB Playback ‎(‎Movies‎,‎ Pictures‎,‎ Music‎)‎1 PC inputPower100-240-50/60 Hz",
        "sku": ": VI505EA0KTU37NAFAMZ",
        "specifications": {
            "SKU": ": VI505EA0KTU37NAFAMZ",
            "Model": ": HTC4388FS",
            "Production Country": ": United Kingdom",
            "Size (L x W x H cm)": ": 995mm*130mm*595mm",
            "Weight (kg)": ": 7.5",
            "Main Material": ": PVC and electrical components",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/2981_b.jpg",
            "products/4851_a.jpg"
        ],
        "stock": 166,
        "reviews": "3.9 out of 5(2024)"
    },
    {
        "title": "NIVEA Nourishing Cocoa Body Lotion With Cocoa Butter 400ml (Pack Of 2)",
        "slug": "nivea-nourishing-cocoa-body-lotion-with-cocoa-butter-400ml-pack-of-2",
        "price_ksh": "KSh 960",
        "price": 7.4,
        "image": "products/3437.jpg",
        "brand": "NIVEA",
        "category": "Health & Beauty",
        "description": "NIVEANourishing CocoaBody Lotion provides 48h nourishing deep moisture care and noticeably smoother skin. The patented formula is using the knowledge, that our skin contains sufficient moisture in its deeper layers. The unique composition of skin’s own moisturizer, moisture-locking lipids and care providing oils bind and hold water in the skin thus the moisture cannot evaporate easily into the surrounding area. The skin is well protected from drying out, because water loss is reduced and the moisture level of the skin is increased.The latest testing methods have shown that the perfect combination of high quality ingredients of our body milk and lotions together with theDEEP MOISTURESERUMpenetrates deeply into the skin, locking moisture and providing deep moisture for 48h. An effect you can not only feel but also see.48h nourishing deep moisture careDEEP MOISTURE SERUM and cocoa butter & vitamin EProvides moisture and smoothes away dullnessLeaves skin nicely fragranced with a scent of cocoa - after just 1 application.With Cocoa ButterINGREDIENTS:Aqua, Glycerin, Cetearyl Alcohol, Isohexadecane, Isopropyl Palmitate, Paraffinum Liquidum, Glyceryl Stearate SE,Butyrospermum Parkii Butter, Dimethicone, Cocos Nucifera Oil, Tocopheryl Acetate, Sodium Cetearyl Sulfate, Carbomer, Trisodium EDTA, Sodium Hydroxide, Phenoxyethanol, Benzyl Alcohol, BHT",
        "sku": ": NI534ST07SEL6NAFAMZ",
        "specifications": {
            "SKU": ": NI534ST07SEL6NAFAMZ",
            "Weight (kg)": ": 1",
            "Main Material": ": -",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [
            "products/3437_b.jpg",
            "products/3438_a.jpg",
            "products/3439_a.jpg",
            "products/3440_a.jpg",
            "products/3441_a.jpg",
            "products/3442_a.jpg",
            "products/3443_a.jpg"
        ],
        "stock": 173,
        "reviews": "4.6 out of 5(1841)"
    },
    {
        "title": "Garnier Charcoal Serum With AHA+BHA 30ml Twin Pack",
        "slug": "garnier-charcoal-serum-with-ahabha-30ml-twin-pack",
        "price_ksh": "KSh 2,960",
        "price": 22.82,
        "image": "products/5975.jpg",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "One is never enough, get two!Introducing our 1st charcoal serum for blemish-prone skin. Also suitable for acne-prone skin. Formulated with 4% [AHA + BHA + Niacinamide], our serum visibly reduces blemishes, improves the appearance of residual marks, and helps to resurfaces skin for smoother and more even-looking skin. This scientifically-proven formula helps mattify and visibly smooth skin texture. Our formula is trusted by our board of dermatologists* and is suitable for all skin types: even sensitive!The serum's fast-absorbing, lightweight gentle formula leaves no visible residue or stickiness. Our formula is trusted by our board of dermatologists* and is suitable for all skin types, even sensitive. The Science behind the Serum: Our serum is enriched with powerful active ingredients, including AHA + BHA (Salicylic Acid) + NIACINAMIDE. The formula helps reduce the appearance of blemishes and pores, and after 1 use skin is left deeply purified & mattified.AHAis known to exfoliate dull & uneven skin.BHA(Salicylic Acid) helps to reduce the appearance of blemishes and size of pores.Niacinamideis known to soothe skin and reduce discomfort.Charcoalis a natural origin ingredient known for it's purifying properties and helps to mattify skin.All Garnier products globally are officially approved by Cruelty Free International under the Leaping Bunny Programme, the leading organization working to end animal testing worldwide, and the recognized Cruelty Free Gold Standard. Both the box and bottle are recyclable, and the box is made of FSC-approved cardboard.",
        "sku": ": GA297ST1S1XQ0NAFAMZ",
        "specifications": {
            "SKU": ": GA297ST1S1XQ0NAFAMZ",
            "Weight (kg)": ": 0.06",
            "Main Material": ": Gloss",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/5975_b.jpg",
            "products/8355_a.jpg",
            "products/2371_a.jpg",
            "products/8355_c.jpg",
            "products/2371_c.jpg",
            "products/2371_e.jpg",
            "products/8355_e.jpg",
            "products/8355_g.jpg"
        ],
        "stock": 161,
        "reviews": "4.4 out of 5(668)"
    },
    {
        "title": "Garnier Day & Night Vitamin C Serum Routine Pack",
        "slug": "garnier-day-night-vitamin-c-serum-routine-pack",
        "price_ksh": "KSh 3,400",
        "price": 26.21,
        "image": "products/2253.jpg",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "Reduce dark marks two times faster with the New Bright Complete Pack!It has the two essentials serums to be used, for your day routine and night time routine.Day Skin Routine Serum:Vitamin C Booster Serum.Night Skin Routine Serum:Vitamin C Even & Bright Night Serum.Garnier Even & Matte Vitamin C Booster Serum - DayThe Garnier Vitamin C Booster Serum is our most concentrated brightening and spot reduction formula in a face serum. Enriched with 3.5% Vitamin C, Niacinamide & Salicylic Acid, this lightweight and non-oily formula instantly penetrates into the skin giving skin an instant glow andreduces 43%of dark marks in just 8 weeks.Vitamin C: brightens & reduces dark spotsNiacinamide: Controls excess oil productionSalicylic Acid: Prevents breakoutsGarnier Even & Bright Night Booster Serum - NightEven better together! Double the Vitamin C Power with the New Garnier Vitamin C Night Serum .It has a supercharged formula with 10% pure vitamin C for more radiant skin.It limits the appearance of dark marks and works as you get your beauty sleep. Together with the Vitamin C Booster Serum, it helps reduce dark marks 2 times faster.After the first wake up*: Skin looks smoother, supplier, revitalized and rested.After 3 nights*: Skin looks brighter, healthierAfter 2 months*: Reduction on dark marks, fine lines and unevennessHow to Use:For Day Routine:1. Cleanse your face with Garnier Even and Matte Cleansing Foam and pat dry.2. Take a pea sized amount of the Vitamin C Booster Serum in your palms. Spread it between your palms without rubbing too much.3. Dab the serum all over your face and neck using small and gentle tapping motions.4. Follow up with the Garnier Even and Matte Vitamin C Protection Cream SPF30. For best results, use daily.For Night Routine:1. Cleanse your face with Garnier Even and Matte Cleansing Foam and pat dry.2. Take a pea sized amount of the Vitamin C Even & Bright Serum in your palms. Spread it between your palms without rubbing too much.3. Dab the serum all over your face and neck using small and gentle tapping motions.4. Follow up with a skin moisturizer.",
        "sku": ": GA297ST2IGCO6NAFAMZ",
        "specifications": {
            "SKU": ": GA297ST2IGCO6NAFAMZ",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 0.06",
            "Certifications": ": Fair Trade",
            "Main Material": ": Serum",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/2253_b.jpg",
            "products/1431_a.jpg",
            "products/1431_c.jpg",
            "products/1431_e.jpg",
            "products/1431_g.jpg",
            "products/1431_i.jpg",
            "products/1431_k.jpg"
        ],
        "stock": 59,
        "reviews": "4.4 out of 5(948)"
    },
    {
        "title": "NIVEA Pearl & Beauty Anti-Perspirant Rollon, 48h - 50ml (Pack Of 2)",
        "slug": "nivea-pearl-beauty-anti-perspirant-rollon-48h-50ml-pack-of-2",
        "price_ksh": "KSh 780",
        "price": 6.01,
        "image": "products/3474.jpg",
        "brand": "NIVEA",
        "category": "Health & Beauty",
        "description": "Pearl & Beauty Anti-PerspirantDeodorant for Women - 50ml for smooth and beautiful underarmsPearl & Beauty alcohol-free deodorant Rollon for women provides effective deodorising and anti-perspirant protection, leaving your skin velvety smooth and soft. The precious pearl extract formula leaves your underarms feeling soft and beautiful and provides a delicate fragrance for women which is gentle to your skin. Pearl & Beauty Anti-Perspirant Deodorant offers 48-hour protection against sweat and body odour so you can relax throughout the day no matter what you are doing. NIVEA care provides skin tolerance and dermatologically approved skincare with a beautiful scent that gives you confidence and anti-protection at all times.The deodorant fits easily into your handbag so you can always have access to instant protection and freshness. Pearl & Beauty is an anti-perspirant women can rely on.Directions: Apply in the morning or after showering. Simply roll alcohol-free deodorant on underarms. Do not apply to broken or irritated skin. Allow product to dry completely before dressing. Soft, luxurious dryness all day!Product benefits:Anti-PerspirantPearl ExtractGentle FragranceNIVEA CareINGREDIENTSAqua, Aluminum Chlorohydrate, PPG-15 Stearyl Ether, Steareth-2, Steareth-21, Parfum, Hydrolyzed Pearl, Trisodium EDTA, BHT, Geraniol, Benzyl Alcohol",
        "sku": ": NI534ST0DQQMYNAFAMZ",
        "specifications": {
            "SKU": ": NI534ST0DQQMYNAFAMZ",
            "GTIN Barcode": ": 4005900098177",
            "Weight (kg)": ": 1",
            "Main Material": ": -",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [
            "products/3474_b.jpg",
            "products/3475_a.jpg",
            "products/3476_a.jpg",
            "products/3477_a.jpg",
            "products/3478_a.jpg",
            "products/3479_a.jpg",
            "products/3481_a.jpg",
            "products/3482_a.jpg"
        ],
        "stock": 30,
        "reviews": "4.4 out of 5(1720)"
    },
    {
        "title": "NIVEA Radiant & Beauty Advanced Care Lotion For Women - 400ml (Pack Of 2) + Pearl & Beauty Anti-Perspirant Rollon For Women, 48h - 50ml",
        "slug": "nivea-radiant-beauty-advanced-care-lotion-for-women-400ml-pack-of-2-pearl-beauty-anti-perspirant-rollon-for-women-48h-50ml",
        "price_ksh": "KSh 1,460",
        "price": 11.26,
        "image": "products/2019.jpg",
        "brand": "NIVEA",
        "category": "Health & Beauty",
        "description": "NIVEA Radiant & Beauty Advanced Care lotion is enriched with 5 natural oils: Almond, Soybean, Avocado, Macadamia, and Olive Oil. This blend of oils gives you lingering nourishment and skin glow.NIVEA Radiant & Beauty locks in your natural moisture, keeping you hydrated so you can bring out your natural shine. It contains glycerine that keeps skin moisturized, so you no longer need to reapply moisturizer or enrich your body lotion for that moisture boost. The lotion also contains5 skin vitamins: A, E, C, B3+Pro, and B5,which keep your skin supple and emollient.Product Benefits:48H long lasting nourishmentHelps reduce and Smoothen StretchmarksHelps repair Dry and Ashy skinHelps repair the roughest part of your skin: elbows, arms, KnucklesGives your skin a healthy GlowINGREDIENTS: Aqua, Glycerin, Paraffinum, Liquidum, Cetearyl Alcohol, Glyceryl Stearate SE, Isopropyl Palmitate, Dicaprylyl Ether, Glyceryl Stearate, Hydroxypropyl,Starch Phosphate, Glycine Soja Oil,Phenoxyethanol, Caprylic/Capric Triglycride, Cera Microcristalli-na,Sodium Cetearyl Sulphate, Trisodium EDTA,Ethylhexyglycerin, Tocopheryl Acetate, Citric Acid,Potassium Lactate, Macadamia Integrifolia seed Oil,Olea Europaea Fruit Oil, Persea Gratissima Oil, Prunus Amygdalus Dulcis Oil,Niacinamide,Retinyl Palmitate, Lactic Acid, Sodium Ascorbyl Phosphate,Panthenol, Ricinus Communis Seed Oil,Tacopherol, Pantolactone,Propyl Gallate,BHT,Parfum.",
        "sku": ": NI534ST10EWYNNAFAMZ",
        "specifications": {
            "SKU": ": NI534ST10EWYNNAFAMZ",
            "Weight (kg)": ": 1",
            "Main Material": ": -",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [
            "products/2019_b.jpg",
            "products/2025_a.jpg",
            "products/2030_a.jpg",
            "products/2034_a.jpg",
            "products/2038_a.jpg",
            "products/2043_a.jpg"
        ],
        "stock": 123,
        "reviews": "4.5 out of 5(861)"
    },
    {
        "title": "Garnier Pure Active 3 In1 Charcoal  Anti  Blackhead Mask Wash Scrub -150ml",
        "slug": "garnier-pure-active-3-in1-charcoal-anti-blackhead-mask-wash-scrub-150ml",
        "price_ksh": "KSh 942",
        "price": 7.26,
        "image": "products/1387.jpg",
        "brand": "Garnier",
        "category": "Health & Beauty",
        "description": "Garnier Pure Active 3 in 1 Anti Blackhead Charcoal can be used as a face wash, blackhead scrub and charcoal face mask to visibly reduce the appearance of blackheads, and help to protect against their reappearance. A new generation of gel wash formulated for sensitive skin with imperfections that combines effectiveness against blemishes with a gentle formula. Place your order for thisamazingproduct fromJumia United Kingdomand have it delivered to your doorstep at an amazing priceHow to use:Wash: Apply daily to a wet face. Rinse thoroughly.Scrub: Every day, gently massage to exfoliate skin. Rinse thoroughly.Mask: Up to 3 times per week apply to dry, clean face. Leave on for up to 5 minutes. Rinse thoroughly.Avoid eye and lip area. In case of contact with eyes, rinse them immediately.",
        "sku": ": GA297HB0QCK17NAFAMZ",
        "specifications": {
            "SKU": ": GA297HB0QCK17NAFAMZ",
            "Weight (kg)": ": 0.204",
            "Main Material": ": N/A"
        },
        "images": [
            "products/1387_b.jpg",
            "products/1545_a.jpg",
            "products/1964_a.jpg",
            "products/1964_c.jpg",
            "products/9161_a.jpg",
            "products/9161_c.jpg",
            "products/1387_d.jpg"
        ],
        "stock": 166,
        "reviews": "4.4 out of 5(6042)"
    },
    {
        "title": "Maybelline Lifter Gloss Hydrating Lip Gloss With Hyaluronic Acid, Topaz",
        "slug": "maybelline-lifter-gloss-hydrating-lip-gloss-with-hyaluronic-acid-topaz",
        "price_ksh": "KSh 1,700",
        "price": 13.11,
        "image": "products/1132.jpg",
        "brand": "Maybelline",
        "category": "Health & Beauty",
        "description": "AboutMeet Maybelline’s new next level lip gloss. Drench lips with hydrating shine for a fuller, lifted look. This formula visibly smooths lip surface and enhances lip contour with high shine. This hydrating lip gloss is available in a full range of modern shades, like Pearl, Ice, Amber, Topaz, Crystal and more. Formula with Hyaluronic Acid. Apply it for a hydrating, glossy shine and fuller look.BenefitsOur new next level lip gloss. Its formula with hyaluronic acid delivers the utmost hydration for natural, fuller looking lips. Our breakthrough formula with Hyaluronic acid visibly smoothes the lip’s surface and enhances lip contour with high shine for hydrated, fuller looking lips. Lifter lip gloss comes with XL wand to enhance lip contour with shine and immediately transform lips in one swipe.How to use/applyStep 1. Apply lip gloss with the XL Wand™ applicator in the centre of your upper lip and follow the contours of your mouth.Step 2. Glide the lip gloss across the entire bottom lip.IngredientsG2033552 C18-36 Acid Triglyceride, Bis-Diglyceryl Polyacyladipate-2, Pentaerythrityl Tetraisostearate, Polybutene, Tridecyl Trimellitate, Diisostearyl Malate, Silica Dimethyl Silylate, Phenoxyethanol, Ethylhexyl Palmitate, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Ethylhexylglycerin, Calcium Sodium Borosilicate, Sorbic Acid, Calcium Aluminum Borosilicate, Tocopheryl Acetate, Sodium Saccharin, Alumina, Synthetic Fluorphlogopite, Silica, Polybutylene Terephthalate, Trihydroxystearin, Cocos Nucifera Oil / Coconut Oil, Aluminum Hydroxide, Ethylene/Va Copolymer, Acrylates Copolymer, Tin Oxide, Magnesium Silicate, Sodium Hyaluronate, Tocopherol, Glucomannan, Parfum / Fragrance [+/- May Contain / Peut Contenir Ci 77891 / Titanium Dioxide, Ci 77491, Ci 77492, Ci 77499 / Iron Oxides, Mica, Ci 15850 / Red 7, Ci 45410 / Red 28 Lake, Ci 15985 / Yellow 6 Lake, Ci 42090 / Blue 1 Lake, Ci 15850 / Red 6, Ci 17200 / Red 33 Lake, Ci 45380 / Red 22 Lake, Ci 19140 / Yellow 5 Lake] Fil T243599/11",
        "sku": ": MA274ST0RED70NAFAMZ",
        "specifications": {
            "SKU": ": MA274ST0RED70NAFAMZ",
            "GTIN Barcode": ": 03600531609696",
            "Model": ": 009",
            "Weight (kg)": ": 0.3",
            "Main Material": ": Liquid"
        },
        "images": [
            "products/1132_b.jpg",
            "products/2646_a.jpg",
            "products/2646_c.jpg",
            "products/2646_e.jpg",
            "products/0491_a.jpg",
            "products/2646_g.jpg"
        ],
        "stock": 172,
        "reviews": "4.6 out of 5(884)"
    },
    {
        "title": "Vitron HTC3200S, 32\" Smart Frameless Android LED TV, With Bluetooth, (1YR WRTY)",
        "slug": "vitron-htc3200s-32-smart-frameless-android-led-tv-with-bluetooth-1yr-wrty",
        "price_ksh": "KSh 11,199",
        "price": 86.34,
        "image": "products/9129.jpg",
        "brand": "Vitron",
        "category": "Electronics",
        "description": "The HTC3200S VITRON 32 inch, HDSmart Android LED TVfeatures sharply and vividly conveys the colour of the image making it true to life as you view it. Enjoy access to youtube,netflix, Facebook and many more apps with ease. It now has aBluetoothfeature to connect to your wireless audio devices. It carries a powerful multi-surround sound effect this increases the excitement and takes your normal sports watching a pleasurable experience. TV comes with Smart features like a dedicated web browser, Bluetooth  and popular apps likeYouTube , Netflixand a range of movie on demands services. Playback your stored content directly on the big screen for all to enjoy via a USB device or use it to record TV programmes.  Place your order for this amazing product from Jumia United Kingdom and have it delivered to your doorstep at an amazing price.DescriptionTechnical SpecificationsDisplayScreen size: 32\"Resolution: 1366*768Tv Technology: SMART Android LEDConnectivityPorts: USB(2), HDMI (3), AV input(1)Cabinet Audio SystemBright treble, full mid range, deep bass, bring you and your family a thrilling listening experience.DNR Noise Reduction TechnologyBuilt-in 3D noise reduction make the signal stable and the picture realistic.Additional FeaturesHD - More Vivid ImagesNo light dot, restore natural colors, 360 degree reproduction of scene.Multi-interface, multi-play, enjoy streaming experience.Save energy, Save your money.",
        "sku": ": VI505EA3X4HB8NAFAMZ",
        "specifications": {
            "SKU": ": VI505EA3X4HB8NAFAMZ",
            "Model": ": HTC3200S",
            "Production Country": ": United Kingdom",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 11.3",
            "Main Material": ": PVC & electrical components",
            "Care Label": ": N/A",
            "Warranty Type": ": Repair by Vendor"
        },
        "images": [
            "products/9129_b.jpg",
            "products/2271_a.jpg",
            "products/2271_c.jpg",
            "products/2271_e.jpg"
        ],
        "stock": 51,
        "reviews": "4.1 out of 5(374)"
    },
    {
        "title": "NIVEA Perfect & Radiant Even Tone Day And Night Cream For Women - 50ml",
        "slug": "nivea-perfect-radiant-even-tone-day-and-night-cream-for-women-50ml",
        "price_ksh": "KSh 1,260",
        "price": 9.71,
        "image": "products/3405.jpg",
        "brand": "NIVEA",
        "category": "Health & Beauty",
        "description": "NIVEA Perfect & RadiantEven ToneDay CreamSPF 15 enriched with Eventone Pure Active, Vitamin E and SPF 15 works to gradually enhance skin complexion and visibly reduce the appearance of dark marks, while protecting your skin from harmful effects of the sun.NIVEA Perfect & Radiant Even ToneNight Creamenriched with Eventone Pure Active, Pearl Extract & Vitamin C works during the night to support the skin's natural renewal process and rejuvenate the skin. It visibly restores even skin tone, enhances skin complexion and reduces the appearance of dark marks.NIVEA Perfect & Radiant Even Tone Day Cream 50mlSPF 15+ UVA filters protect your skin against dark marks and helps reduce premature skin ageingThe non-greasy, silky, smooth formula is easily absorbed, while providing your skin with lasting moisture, leaving it feel soft and smoothThe formula works in harmony with your skin to even out the skin tone and improve complexionNIVEA Perfect & Radiant Even Tone Night Cream 50mlThe nourishing formula provides your skin with lasting moisture leaving it soft and smoothThe formula works in harmony with your skin to even out the skin tone and improve complexionNIVEA Perfect & Radiant Even Tone Day Cream 50mlINGREDIENTS:Aqua, Ethylhexyl Methoxycinnamate, Glycerin, Benzophenone-3, Alcohol Denat., Cyclomethicone, Distarch Phosphate, Glyceryl Stearate Citrate, Butyl Methoxydibenzoylmethane, Cetearyl Alcohol, Myristyl Myristate, Octyldodecanol, Hydrolyzed Pearl, Glycyrrhiza Glabra Root Extract, Sodium Ascorbyl Phosphate, Tocopheryl Acetate, Fucus Vesiculosus Extract, Nelumbium Speciosum Flower Extract, Panax Ginseng Root Extract, Glyceryl Glucoside, Caprylic/Capric Triglyceride, Propylene Glycol, Sodium Carbomer, Sodium Polyacrylate, 1,2-Hexanediol, Trisodium EDTA, Phenoxyethanol, Linalool, Butylphenyl Methylpropional, Alpha-Isomethyl Ionone, Benzyl Alcohol, Geraniol, Citronellol, BHT, Parfum, CI 77891NIVEA Perfect & Radiant Even Tone Night Cream 50mlINGREDIENTS:Aqua, Glycerin, Tapioca Starch, Cetearyl Alcohol, Alcohol Denat., Sodium Palmitate, Glyceryl Stearate, Sodium Stearate, Hydrogenated Coco-Glycerides, Myristyl Myristate, Hydrolyzed Pearl, Glycyrrhiza Glabra Root Extract, Panthenol, Sodium Ascorbyl Phosphate, Tocopheryl Acetate, Nelumbium Speciosum Flower Extract, Fucus Vesiculosus Extract, Panax Ginseng Root Extract, Glyceryl Glucoside, 4-Butylresorcinol, Sodium Myristate, Sodium Arachidate, Sodium Oleate, C12-15 Alkyl Benzoate, Caprylic/Capric Triglyceride, Cera Microcristallina, Dimethicone, Paraffinum Liquidum, Carbomer, Propylene Glycol, Phenoxyethanol, Methylparaben, BHT, Linalool, Butylphenyl Methylpropional, Alpha-Isomethyl Ionone, Benzyl Alcohol, Geraniol, Citronellol, Parfum, CI 7789",
        "sku": ": NI534ST01U2JENAFAMZ",
        "specifications": {
            "SKU": ": NI534ST01U2JENAFAMZ",
            "GTIN Barcode": ": 6001051005529",
            "Weight (kg)": ": 1",
            "Main Material": ": -",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [
            "products/3405_b.jpg",
            "products/3406_a.jpg",
            "products/3407_a.jpg",
            "products/3408_a.jpg",
            "products/3409_a.jpg",
            "products/3410_a.jpg",
            "products/3411_a.jpg",
            "products/3412_a.jpg"
        ],
        "stock": 131,
        "reviews": "4.3 out of 5(3718)"
    },
    {
        "title": "Vitron V527 - 2.1 CH Multimedia Speaker, BT/USB/SD/FM - 9000W (1YR WRTY)",
        "slug": "vitron-v527-21-ch-multimedia-speaker-btusbsdfm-9000w-1yr-wrty",
        "price_ksh": "KSh 5,199",
        "price": 40.08,
        "image": "products/6998.jpg",
        "brand": "Vitron",
        "category": "Electronics",
        "description": "Vitronaudio delivers the wides range of options in home theatre entertainment systems. Our systems feature a seamless design with powerful full-range drivers to deliver powerful, clear 360° stereo sound with deep bass. Extra wired subwoofer pumping out ground-shaking bass for immersive home theatre experience at home.TheBluetooth speakersystem plays FM radio, and MP3 from the USB and SD card slots.Delivering intuitive sound features that let you choose the quality of performance you need, and clear LED displays to improve your usability. Out home theatre speakers come in wide range of built-in add-ons, like Bluetooth, Auxilliary, USB, and Micro SD in addition to supporting MP3, FM Radio and many more. Buy online and get it delivered to your door with this exclusive offer from Jumia.",
        "sku": ": VI505EL092BF0NAFAMZ",
        "specifications": {
            "SKU": ": VI505EL092BF0NAFAMZ",
            "Model": ": V527",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 5",
            "Main Material": ": PVC",
            "Care Label": ": HANDLE WITH CARE<br />"
        },
        "images": [
            "products/6998_b.jpg",
            "products/5927_a.jpg",
            "products/5927_c.jpg"
        ],
        "stock": 75,
        "reviews": "4 out of 5(1734)"
    },
    {
        "title": "TCL 43S5400 S Series, 43\" Full HD Smart TV - Black (1YR WRTY)",
        "slug": "tcl-43s5400-s-series-43-full-hd-smart-tv-black-1yr-wrty",
        "price_ksh": "KSh 26,099",
        "price": 201.22,
        "image": "products/2592.jpg",
        "brand": "TCL",
        "category": "Electronics",
        "description": "43S5400 S Series, 43-InchFull HD Metallic Bezel-less Design Android TV. Order online from Jumia United Kingdom and have it delivered to your doorstep.SPECIFICATIONSBrand: TCLCategory: TVFamily: SSeries: S5400AModel: 43S5400AYear: 2023TYPEFlat/Curved: FlatBacklight Type: DLEDProduct Type: LED Android TVPLATFORMCPU Core: CA55x4 @1.1GHz (DVFS 1.45GHz)GPU Core: G31MP2 @550MHzOperation System: ATV: PAL/NTSC/SECAM-DK/BG/I/M DTV: DVB-C/T/T2Voice Control: yesGoogle Assistant Built-in: yesApp Store: yesAUDIOAudio Power: 2x9.5WDolby: yesDTS: noDISPLAYPanel Resolution: 1920x1080Aspect Ratio: 16:09Refresh Rate: 60HzDolby vision: noHDR: HDR10HLG: yesHDR 10+: noContrast: 4000:1 (typ.)Micro Dimming: yesLocal Dimming: noSMART FEATURESHands-free Voice ControlvnoWith Google Assistant: yesCONNECTIVITYBlueTooth: BT5.0Wi-Fi Connectivity: 2.4GHzEthernet: RJ45, 10/100MUSB: USB 2.0HDMI: yesFreesync: noOTHER FEATURESEPG: Yes (for DTV programme only)Subtitle: yesDIMENSION & WEIGHTVESA Mounting Type: yes (WMB234)Carton Dimensions LxWxH (mm): 1075×128×652Net Weight With Stand（Kg）: 5.73Net Weight Without Stand（Kg）: 5.67Gross Weight With Packaging（Kg）: 7.93",
        "sku": ": TC187EA25W1RONAFAMZ",
        "specifications": {
            "SKU": ": TC187EA25W1RONAFAMZ",
            "Model": ": S5400A",
            "Size (L x W x H cm)": ": 1.075×1.28×6.52",
            "Weight (kg)": ": 7.93",
            "Main Material": ": -",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/2592_b.jpg",
            "products/0327_a.jpg",
            "products/0327_c.jpg",
            "products/0327_e.jpg",
            "products/0327_g.jpg",
            "products/0327_i.jpg",
            "products/0327_k.jpg",
            "products/0327_m.jpg"
        ],
        "stock": 107,
        "reviews": "4.4 out of 5(294)"
    },
    {
        "title": "Jameson Jameson Irish Whiskey - 1 Litre",
        "slug": "jameson-jameson-irish-whiskey-1-litre",
        "price_ksh": "KSh 2,799",
        "price": 21.58,
        "image": "products/9040.jpg",
        "brand": "Jameson",
        "category": "Grocery",
        "description": "Enjoy Shopping Jamesonat best price in the market at Jumia United Kingdom.Jameson is the best-selling Irish whiskey in the world. Produced in our distillery in Midleton, County Cork, from malted and unmalted Irish barley, Jamesons blended whiskeys are triple-distilled, resulting in exceptional smoothness. The brand has been part of the Pernod Group since 1988 and continues to expand its acclaimed range to offer new taste experiences.Shop from a Huge Collection - Enjoy Shopping Best Offers & Deals Online from Jumia United Kingdom - Receive at your doorstep - Fast Delivery - Secure mode of Payment",
        "sku": ": JA384DR0S5G8XNAFAMZ",
        "specifications": {
            "SKU": ": JA384DR0S5G8XNAFAMZ",
            "GTIN Barcode": ": 05011007003227",
            "Weight (kg)": ": 1l",
            "Main Material": ": Whiskey",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [
            "products/9040_b.jpg",
            "products/9043_a.jpg"
        ],
        "stock": 131,
        "reviews": "4.6 out of 5(291)"
    },
    {
        "title": "Maybelline Lasting Fix Makeup Setting Spray, Matte Finish",
        "slug": "maybelline-lasting-fix-makeup-setting-spray-matte-finish",
        "price_ksh": "KSh 1,887",
        "price": 14.55,
        "image": "products/9470.jpg",
        "brand": "Maybelline",
        "category": "Health & Beauty",
        "description": "No more mid-day touchups! OurLasting Fix Setting sprayprevents makeup from melting or fading. This lightweight mist extends and keeps just applied makeup looking fresh for up to 16HR. Say goodbye to faded and melted makeup. Keep your foundation, powder, eyeshadow, and brows in place for up to 16 hours. Get the maximum matte effect and enhance your makeup wear with our long-lasting setting spray. This lightweight spray controls shine, creates a matte finish, and lasts all through the day.BenefitsUP TO 16HR WEAR: Try Lasting Fix to lock in your look for up to 16HRS! Perfect for busy days and nights, achieve a fresh, just-applied makeup look that lasts for up to 16 hours.MATTE FINISH: Provides a matte finish that lasts all day. Enhance your makeup wear, control shine, and create the ultimate matte effect that will last all day.This makeup finishing spray glides onto the skin for a lightw8 and breathable finish and lasts all thorough the day with a soft, comfortable hold.This all-day wear makeup setting spray is dermatologist tested, allergy tested, and suitable for sensitive skinHow to use/applyLock in your makeup look!Step 1.Shake the bottle well.Step 2.Hold 8-10\" away from the face and ensure your eyes are closed.Step 3.Spray 4-6 times around your face. Avoid spraying directly into eyes and lips.IngredientsQUA / WATER / EAU, ALCOHOL DENAT., PROPYLENE GLYCOL, AMP-ACRYLATES/ALLYL METHACRYLATE COPOLYMER, PVP, TALC, PHENOXYETHANOL, DISODIUM EDTA, CHLORPHENESIN, TRIETHANOLAMINEF.I.L. D227511/1",
        "sku": ": MA274HB0J6YRFNAFAMZ",
        "specifications": {
            "SKU": ": MA274HB0J6YRFNAFAMZ",
            "GTIN Barcode": ": 03600531533694",
            "Weight (kg)": ": 0.168",
            "Main Material": ": N/A",
            "From the Manufacturer": ": <font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\">​</font></font>",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/9470_b.jpg",
            "products/9470_d.jpg",
            "products/9470_f.jpg",
            "products/9470_h.jpg",
            "products/9470_j.jpg",
            "products/9470_l.jpg",
            "products/9470_n.jpg"
        ],
        "stock": 10,
        "reviews": "4.4 out of 5(2004)"
    },
    {
        "title": "STY 4pcs Ladies Handbags Women Shoulder Tote Bags Set PU Leather-Black",
        "slug": "sty-4pcs-ladies-handbags-women-shoulder-tote-bags-set-pu-leather-black",
        "price_ksh": "KSh 814",
        "price": 6.28,
        "image": "products/8074.jpg",
        "brand": "STY",
        "category": "Fashion",
        "description": "Store Name:STY store-CODSize:Handbag:25x13x25cmMessenger Bag:23x6x15cmClutch:20x12cmCard package:12x9cmMaterial:PU leatherStyle：FashionFeatures:WaterproofZipperColor：BlackGender：WomenBag Hardness: SoftRemovable and adjustable shoulder strapHighly resistant to scratches and tears, not easy to deform packageConvertible Carrying Ways: The bag can be used as Handbags/ shoulder bag / PouchNoteMaybe the bags have a little peculiar smell, put them in a ventilated place about two daysIf the shape of the product received is not right, you can use a hair dryer to shape it",
        "sku": ": GE840FC0OI6PONAFAMZ",
        "specifications": {
            "SKU": ": GE840FC0OI6PONAFAMZ",
            "Model": ": BST1",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": 25*13*25",
            "Weight (kg)": ": 0.8",
            "Main Material": ": Leather"
        },
        "images": [
            "products/8074_b.jpg",
            "products/4907_a.jpg",
            "products/8074_d.jpg",
            "products/0970_a.jpg",
            "products/4907_c.jpg",
            "products/4907_e.jpg",
            "products/4907_g.jpg",
            "products/4907_i.jpg"
        ],
        "stock": 141,
        "reviews": "3.5 out of 5(2147)"
    },
    {
        "title": "Ranee Biryani - 5 Kg",
        "slug": "ranee-biryani-5-kg",
        "price_ksh": "KSh 1,450",
        "price": 11.18,
        "image": "products/7435.jpg",
        "brand": "Ranee",
        "category": "Grocery",
        "description": "Ranee rice has a special aroma, is gluten-free and low in fat. Long grain rice is suitable for multiple recipe varieties (Biryani / Coastal / Spicy dishes), with an exquisite flavour and is pocket-friendly. Order for this Ranee ​​​​​​​BiryaniLong Grain Rice online from Jumia United Kingdom and have it delivered to your doorstep.AboutCapwell Industries Limited started its operations in 1999 with a maize milling factory in Thika. We manufacture high quality maize flour, pulses, rice, porridge and wheat flour using the best processes and modern technology available.",
        "sku": ": RA759FF09O6WJNAFAMZ",
        "specifications": {
            "SKU": ": RA759FF09O6WJNAFAMZ",
            "GTIN Barcode": ": 06161102170832",
            "Production Country": ": United Kingdom",
            "Weight (kg)": ": 1",
            "Main Material": ": Biryani Rice",
            "Care Label": ": Store in a cool dry place",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [],
        "stock": 58,
        "reviews": "4.2 out of 5(69)"
    },
    {
        "title": "128GB Metal Usb Flash Drive  3D Embossment",
        "slug": "128gb-metal-usb-flash-drive-3d-embossment",
        "price_ksh": "KSh 624",
        "price": 4.81,
        "image": "products/4730.jpg",
        "brand": "Generic",
        "category": "Computing",
        "description": "Feature:128GB metal Usb Flash Drive 3D embossment+micro Usb + Type C usbthis item is not compatible to TVif you need to purchase usb compatible to TV, you can purchase item by below link.Generic 128 GB OTG Usb Flash Drive Adapter Type C 3 Units In 1 Set @ Best Price Online - Jumia United Kingdom·  Support USB version 2.0·  Capacity: 128GB·  Hot Plug & Play·  Durable solid-state storageNo external power is required 4.5V ~ 5.5V from USB portCompatible with USB 1.1/2.0Operating Temp: -10 to +55Deg.CStorage Temp: -20 to +55Deg.CLife:>1 million timesRead Rate: 12Mb-18Mb/S    Write Rate: 5-10 Mb/SExcellent USB Memory stick in excellent conditionWhythe USB flash drive real capacity is not correct capacity?Vendors are using Flash memory decimal arithmetic: 1 MB = 1000KB, 1G = 1000 MBCalculated, operating system with binary arithmetic: 1 MB = 1024KB, 1 GB = 1024 MB;So there are some differences between display capacity and nominal capacity of flash memory productsAbout Real capacity:32GB = approximately 28.5GB-30GB64GB = approximately 58.5GB-60GB128GB = approximately 110GB-124GBAttention:1. To avoid data loss or mechanical damage, do not power down your computer or unplug flash disk during transfer.2. Please do not remove your USB flash drive when it is being used otherwise your data may loss.3. After using USB flash drive, it is better to remove it as soon as possible. That will helps to extend its storage lifetime.",
        "sku": ": GE840EA1BKT7BNAFAMZ",
        "specifications": {
            "SKU": ": GE840EA1BKT7BNAFAMZ",
            "Model": ": 128GB Metal OTG Usb Flash Drive Waterproof 3D Embossment  +micro Usb + Type C",
            "Size (L x W x H cm)": ": 13x2x2",
            "Weight (kg)": ": 0.02",
            "Main Material": ": metal"
        },
        "images": [
            "products/4730_b.jpg",
            "products/4730_d.jpg",
            "products/4730_f.jpg",
            "products/4730_h.jpg",
            "products/4730_j.jpg",
            "products/4730_l.jpg",
            "products/4730_n.jpg"
        ],
        "stock": 199,
        "reviews": "3.5 out of 5(1124)"
    },
    {
        "title": "Vision Plus 32\" Digital HD Frameless TV, DVBT2/S2 - Black (2YRS WRTY)",
        "slug": "vision-plus-32-digital-hd-frameless-tv-dvbt2s2-black-2yrs-wrty",
        "price_ksh": "KSh 9,799",
        "price": 75.55,
        "image": "products/3014.jpg",
        "brand": "Vision Plus",
        "category": "Electronics",
        "description": "Stunning picture quality meets sleekly modern design with Vision Plus 32\" Digital TV , which brings you HD entertainment at an incredible value. This  TV delivers amazing picture quality and clarity.  HDMI and USB ports are perfect for connecting all your high definition entertainment devices to the TV.Order for this Vision Plus 32\" TV online from JumiaUnited Kingdom and have it delivered to you.Connectivity: Vision Plus 32\" TV has a powerful stream media that helps you read the audio and video files in your mobile devices at anytime. You can also browse your fascinating photos while enjoying music. Our TV has powerful identification and reading functions, providing much better choice for youEnergy Saving Feature: This TV is ENERGY STAR-qualified which prevent greenhouse gas emissions by meeting strict energy efficiency guidelines set by the U.S. Environmental Protection Agency and the U.S. Department of Energy. The ENERGY STAR name and marks are registered marks owned by the U.S. government, as part of their energy efficiency and environmental activities.Technical SpecificationsDisplay32\" ScreenMain FeaturesUSBDigital D_VBT2 Free to AirDVBT2/S2Connectivity3 HDMI input1 PC audio‎ in/Earphones1 USBAVRFOptical OutFeaturesDigital DVB ‎T2/S2 Free to AirUSB Playback ‎(‎Movies‎,‎ Pictures‎,‎ Music‎)‎1 PC inputPower100-240-50/60 Hz",
        "sku": ": VI799EA1QMSQ4NAFAMZ",
        "specifications": {
            "SKU": ": VI799EA1QMSQ4NAFAMZ",
            "Model": ": VP8832DF",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 3",
            "Main Material": ": pvc",
            "From the Manufacturer": ": <br>",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/3014_b.jpg",
            "products/3014_d.jpg"
        ],
        "stock": 155,
        "reviews": "4 out of 5(737)"
    },
    {
        "title": "Plain Finest Denim Slim Fit Black Jeans+FREE BELT.",
        "slug": "plain-finest-denim-slim-fit-black-jeansfree-belt",
        "price_ksh": "KSh 1,566",
        "price": 12.07,
        "image": "products/2658.jpg",
        "brand": "Generic",
        "category": "Fashion",
        "description": "Men's Jeans Trouser Stylish Pocketed. Uppermost superiority great look. Straight Fit men’s Jeans. Very comfortable through seat and thigh. Machine wash, tumble dry. A Comfortable and Stylish jeans which can be worn for any occasion. Order for this Men's Jeans Trouseronline from Jumia United Kingdomand have it delivered to your doorstep.FeaturesButton closureStrong and Neat StitchingSoft Cotton Fabrics material used in these JeansMachine WashableVery Comfortable to WearThe highest standards regarding quality and style",
        "sku": ": GE840MW2EE4KYNAFAMZ",
        "specifications": {
            "SKU": ": GE840MW2EE4KYNAFAMZ",
            "Weight (kg)": ": .0001",
            "Main Material": ": DENIM",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/2658_b.jpg",
            "products/2658_d.jpg"
        ],
        "stock": 120,
        "reviews": "4 out of 5(55)"
    },
    {
        "title": "William Lawson's William Lawson's Scotch Whisky – 750ml",
        "slug": "william-lawsons-william-lawsons-scotch-whisky-750ml",
        "price_ksh": "KSh 1,699",
        "price": 13.1,
        "image": "products/9347.jpg",
        "brand": "William Lawson's",
        "category": "Grocery",
        "description": "William Lawson's Finest Blend Scotch Whisky is perfectly balanced, like great scotch should be. This scotch liquor is blended with strong malts and grain whiskies for a big, bold flavor. Created in 1849 by William Lawson, this blended scotch alcohol does things differently, with none of the peat or smoke of more traditional scotch. This single malt scotch delivers notes of toasted cereal, juicy apple and chewy toffee. Sip William Lawson's Finest Blend neat in a whisky glass, on the rocks, or in alcohol drinks like a William Lawson's & Coke. Enjoy William Lawson's Responsibly.William Lawson's Finest Blend is 40% alcohol by volumeBest served in your favorite whisky glass neat, on the rocks or in a William Lawson's & Coke cocktailScotch liquor blended with strong malts and grain whiskies for a big, bold flavorFeaturing notes of toasted cereal, juicy apple and chewy toffeePerfectly balanced scotch whisky created in 1849William Lawson's Finest Blend Scotch WhiskyNothing to stop you enjoying its big, bold fruity flavour. Its taste of toasted cereal. Hint of juicy apple. And dollop of chewy toffee. But don’t just take our word, take a sip. Or two.",
        "sku": ": WI594DR1MASJENAFAMZ",
        "specifications": {
            "SKU": ": WI594DR1MASJENAFAMZ",
            "GTIN Barcode": ": 05010752000321",
            "Weight (kg)": ": 1",
            "Main Material": ": -",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [
            "products/9347_b.jpg",
            "products/9349_a.jpg"
        ],
        "stock": 28,
        "reviews": "4.6 out of 5(69)"
    },
    {
        "title": "ARHANORY Phone Tripod Stand Mobile Phone Holder Mount Ring Light Set Selfie Stick-Black",
        "slug": "arhanory-phone-tripod-stand-mobile-phone-holder-mount-ring-light-set-selfie-stick-black",
        "price_ksh": "KSh 407",
        "price": 3.14,
        "image": "products/5488.jpg",
        "brand": "ARHANORY",
        "category": "Phones & Tablets",
        "description": "Tripod Stand +Ring Light SetTripodsBrand: ARHANORYSize:16.5x8.5cmMaterial: PlasticFeatures: Adjustable tabletop tripod and gripFlexible: Angle can be adjusted up and down by 180°Multi-purpose: Use as selfie stick/ phone tripod/ table top tripod/ camera stand/ camera gripSturdy: Mounted cameras are firm and do not slip or fallOccasion: Could used for live Broadcast/ Video blog/ Selfie/ PhotographyCompatibility: Apply to most phones and video cameras, digital cameras, projector, and scopes with 1/4” screw threadRing lightSize:8.3x8.3cmFeatures:3-level Adjustable BrightnessRing Light: Has 36 LED lamp beads to help you illuminate your surroundings.Rechargeable Ring Light: Can work continuously for 2 hours (recharge for 2 hours after receiving the product！！！)Occasion: Can be used for selfie/ party/ video/ live broadcastCompatibility: Compatible with smartphones, laptops. Simply clip it onto your device to install.Packing ListTripod Stand x1Ring Light x1Phone Holder x1USB Cable x1",
        "sku": ": AR714EA0GY64ENAFAMZ",
        "specifications": {
            "SKU": ": AR714EA0GY64ENAFAMZ",
            "Model": ": TR-1",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": 18x13x3",
            "Weight (kg)": ": 0.14",
            "Main Material": ": Plastic"
        },
        "images": [
            "products/5488_b.jpg",
            "products/5488_d.jpg",
            "products/5488_f.jpg",
            "products/5488_h.jpg",
            "products/5488_j.jpg",
            "products/5488_l.jpg",
            "products/5488_n.jpg",
            "products/5488_p.jpg"
        ],
        "stock": 59,
        "reviews": "3.9 out of 5(892)"
    },
    {
        "title": "Vintage T9 Dragon Rechargeable Metal Hair Clipper Gold",
        "slug": "vintage-t9-dragon-rechargeable-metal-hair-clipper-gold",
        "price_ksh": "KSh 446",
        "price": 3.44,
        "image": "products/9728.jpg",
        "brand": "Generic",
        "category": "Health & Beauty",
        "description": "PS: Please charge it fully before using itZERO GAPPED TRIMMER HAIR CLIPPER. This professional barber's haircut kit is designed with a zero gapped clipper. It also comes with four different sizes of guide combs (1.5mm, 2mm, 3mm, 4mm) allowing you to easily cut your favorite hair length, meeting all your hair trimming and facial care needs. Highly recommended for either barbers use or self-haircutting!SELF-SHARPENING STEEL BLADES. The self-sharpening titanium steel blade ensures the sharpness of the blades and hence ensures smooth hair cutting and no-snag or pulling of hair.USB RECHARGEABLE LONG-LASTING BATTERY. In spite of the compact size of the hair trimmer, the 1500mAh Lithium-ion battery supports over 180 minutes of nonstop run time. Battery can be charged with USB adapter, laptop, power bank, car charger, etc.LOW NOISE. Although a powerful motor (7000RPM) is used, the noise level is very low with our professional design! Noise less than 55 db, perfect for your family. Enjoy the low noise environment while doing haircutting!ERGONOMIC DESIGN HAIR TRIMMER. Vacto T-outline trimmer weighs only 140g and the size is 5.98*0.98in, ideal for both men and women. You can hold the clipper for a long time without getting your hand or arm feel sore. One-button design makes personal haircuts easy to operate. Suitable for oil head, carving, vintage hairstyle, and baldhead.Instructions and Features:1. Easy to use and easy to use. Easy to clean.2.Hair Design: Several fashionable hair styles.3.Barber shop: The professional hair clipper can be used for cutting short hair of children, men or women.4. Clean cut. Precision design stainless steel, super sharp V-shaped cutting angle design, smoother haircut.5.It is mainly used for contouring repair, sculpting .6.Long lasting power.Built-in high performance lithium-ion battery.7.Can be used for a long time after fully charged.8. Small body and wear resistance.9. Ultra-short tooth distance.10.Can be used to prune cutting, automatic grinding will not rust for a long time.11. Smooth cut, will not damage the hair.12. Touching the skin safely without hurting the scalp.13.4 limit combs to help cut hair.6 advantages:SharpLarge capacity batteryStrong powerReduce noiseFast chargeSustainable",
        "sku": ": GE840SE18ZGAXNAFAMZ",
        "specifications": {
            "SKU": ": GE840SE18ZGAXNAFAMZ",
            "Model": ": N/A",
            "Size (L x W x H cm)": ": 26.5x18.5x1.5",
            "Weight (kg)": ": 0.22",
            "Main Material": ": metal",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/9728_b.jpg",
            "products/0071_a.jpg",
            "products/0071_c.jpg",
            "products/0071_e.jpg",
            "products/0071_g.jpg",
            "products/0071_i.jpg",
            "products/0071_k.jpg",
            "products/0071_m.jpg"
        ],
        "stock": 2,
        "reviews": "3.8 out of 5(1308)"
    },
    {
        "title": "Nunix 50 * 55cm Cooker, 4 Gas Burners, Gas Oven (1YR WRTY)",
        "slug": "nunix-50-55cm-cooker-4-gas-burners-gas-oven-1yr-wrty",
        "price_ksh": "KSh 18,480",
        "price": 142.48,
        "image": "products/4415.jpg",
        "brand": "Nunix",
        "category": "Home & Office",
        "description": "Nunix 4 Gas Burners+ Gas Oven affordable‎,‎ quality‎,‎ energy‎-efficient home appliances‎.‎ The brand is well known for their high‎-quality‎,‎ top of the range products and now they are all available on Jumia United Kingdom‎.‎ Order from this exclusive brand online in United Kingdom today and let us deliver right to your doorstep‎.Auto IgnitionNo need to look for match sticks when using the gas burner‎.‎ This cooker comes withauto ignition‎.‎Cook Perfectly EverytimeThis gas‎‐burner will help you cook your food perfectly every time‎‎.‎‎  It provides even distribution of heat and emits less wasted heat than electric stoves so light it up and get cooking‎‎.‎‎Easy CleaningThe surface material of this cooker makes it easy to clean‎.‎ The panels are also removable so you can thoroughly clean‎.‎Oven & Grill",
        "sku": ": NU344HA1VQNKMNAFAMZ",
        "specifications": {
            "SKU": ": NU344HA1VQNKMNAFAMZ",
            "Weight (kg)": ": 15",
            "Main Material": ": -",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/4415_b.jpg",
            "products/4415_d.jpg",
            "products/4401_a.jpg",
            "products/4401_c.jpg",
            "products/4401_e.jpg",
            "products/4401_g.jpg"
        ],
        "stock": 44,
        "reviews": "3.9 out of 5(131)"
    },
    {
        "title": "TCL 55\" P635 4K HDR Google TV - Black (1YR WRTY)",
        "slug": "tcl-55-p635-4k-hdr-google-tv-black-1yr-wrty",
        "price_ksh": "KSh 46,299",
        "price": 356.97,
        "image": "products/9022.jpg",
        "brand": "TCL",
        "category": "Electronics",
        "description": "TCL P635 4K HDR Google TVfeatures a 3840x2160P resolution. With 4K resolution, you can subscribe to your favorite content on Google TV. And you can use your voice to find movies, stream apps, play music, and control your TV. TCL's Dynamic Color Enhancement technology automatically optimizes the color vibrancy of the TV screen to provide a more vivid and better quality video experience. Use your voice to find movies, stream apps, play music, and control the TV. Ask Google. Order online from Jumia United Kingdom and have it delivered to your doorstep.FeaturesTCL P635 Series combines 4K HDR and dynamic colour enhancement for clear4K HDR picture quality.​With Game Master, HDMI 2.1, ALLM (Auto Low Latency Mode), HDR 10 and Dolby Audio supported, you will enjoy any HDR movie, series, game or sport.TCL P635 Series also features the most advanced Smart TV system ever: GOOGLE TV with Google Assistant built-in. ​Easily access to the contents you love.​Functional elegance: the bezeless design of TCL P635 Series allows you to enjoy more of the picture you love.​With Google TV and immersive picture quality and design, this TCL TV will allow endless entertainment.Technical SpecificationsScreen size: 55\"Screen type: LCDRefresh rate: 60HzAspect ratio: 16:9Panel resolution: 3840x2160PAUDIOSpeakers:  20WSound channel : 2Bluetooth Audio only:  YesDolby: Dolby AudioSMART TVTV platform: Google TVVersion: Android 11Apple TV app : YesVoice Assistant : Google AssistantChromecast :  YesYouTube:  YesCONNECTIVITYHDMI: 3 portsUSB: 2 inputsRF input :1Bluetooth: Yes",
        "sku": ": TC187EA1PA488NAFAMZ",
        "specifications": {
            "SKU": ": TC187EA1PA488NAFAMZ",
            "Model": ": P635",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 10",
            "Main Material": ": -",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/9022_b.jpg",
            "products/1113_a.jpg",
            "products/1113_c.jpg",
            "products/1113_e.jpg",
            "products/1113_g.jpg",
            "products/1113_i.jpg",
            "products/1113_k.jpg",
            "products/1113_m.jpg"
        ],
        "stock": 2,
        "reviews": "4.7 out of 5(80)"
    },
    {
        "title": "Hikers KE-MOW20LM-Microwave Oven – 20 Litres –700W- BLACK",
        "slug": "hikers-ke-mow20lm-microwave-oven-20-litres-700w-black",
        "price_ksh": "KSh 6,399",
        "price": 49.34,
        "image": "products/8216.jpg",
        "brand": "Hikers",
        "category": "Home & Office",
        "description": "Kitchens need to be equiped with the best Microwave, that’s why Hikers set out to create a space-saving, great-looking microwave oven that also mounts better, creating a flush, finished look. Order for this Microwave Online on Jumia United Kingdom and have it delivered straight to your doorstep. Hikers offer affordable, quality, energy-efficient home appliances. The brand is well known for their high-quality, top of the range products and now they are all available on Jumia United Kingdom. Hikers sets out to create space-saving and great-looking microwaves did give a complete finish to your Kitchen. This Hikers microwave is designed to be powerful in order to serve you better meals. The microwave has a large turntable did Enables you to load bigger food containers or more food.Brand StoryHikers is a Chinese integrated electronics company, mainly dealing in TV, Bluetooth speakers, Smart watches, Microwave ovens, Electric fans, Air fryers, and other home appliances. Our goal is to lead the forefront of science and technology, pursue a comfortable life, create a warm family, customers first, and take sustainable development as the purpose. Brand background products are exported to Europe, America, Japan, South Korea, and the Middle East in more than 160 countries. The Hikers sales area in Africa covers Nigeria, United Kingdom, South Africa, Ghana, Cote d 'Ivoire, Senegal and other regions, Ghana and United Kingdom have respectively set up factories to provide efficient localized product services. Superior Quality. Hikers strive for continuous breakthroughs in scientific and technological innovation in the process of product development. We explore and implement innovative solutions. By focusing on innovation, Hikers aims to stay at the forefront of technological advances in the industry to provide users with a high-quality smart home experience.Innovative TechnologyWe have more than 100 people on RD teams for Hikers' technical research, They strive for continuous breakthroughs in technological innovation in the product development process. We explore and implement innovative solutions to provide users with high-quality smart home experience. Our MissionUser experience is a top priority for Hikers. To provide users with excellent quality and satisfactory consumption experience. Build a better life with us.SPECIFICATIONSMechanical dial controls6 microwave power levels30-minute timerTime defrostEnd of cooking signalUnit Dimensions ( WXDXH ): 446x340x243 mmCarton Dimensions ( WXDXH ): 466x323x268 mmUnit Weight: 9 . 4kgShipping Weight: 10.1kg",
        "sku": ": HI137HA31U74FNAFAMZ",
        "specifications": {
            "SKU": ": HI137HA31U74FNAFAMZ",
            "Model": ": KE-MOW20LM",
            "Size (L x W x H cm)": ": 44.6*34*24.3",
            "Weight (kg)": ": 9.4",
            "Main Material": ": metal"
        },
        "images": [
            "products/8216_b.jpg",
            "products/2334_a.jpg",
            "products/2334_c.jpg",
            "products/2334_e.jpg",
            "products/2334_g.jpg",
            "products/2334_i.jpg",
            "products/2334_k.jpg",
            "products/2334_m.jpg"
        ],
        "stock": 157,
        "reviews": "4.4 out of 5(232)"
    },
    {
        "title": "Gilbey's Gilbey's Gin - 750 ML",
        "slug": "gilbeys-gilbeys-gin-750-ml",
        "price_ksh": "KSh 1,199",
        "price": 9.24,
        "image": "products/8880.jpg",
        "brand": "Gilbey's",
        "category": "Grocery",
        "description": "Gilbey’sGin is a classic juniper-led London Dry Gin. It is crystal clear with light, floral aromas of juniper along with hints of sweet orange. The palate is clean, light, and dry. Assertive and sharp with a presence of botanicals, juniper, bitter orange rind, and coriander. The finish is moderately long with lingering citrus notes.Gilbey’s Gin is distilled from grain neutral spirits along with 12 other botanicals. Gilbey’s has a reputation of being an inexpensive gin. It may be enjoyed on its own, part of a mixed drink, or a base for cocktails.",
        "sku": ": GI550DR1N23T6NAFAMZ",
        "specifications": {
            "SKU": ": GI550DR1N23T6NAFAMZ",
            "GTIN Barcode": ": 05010103930628",
            "Weight (kg)": ": 750ml",
            "Main Material": ": Gin",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [
            "products/8880_b.jpg",
            "products/8885_a.jpg"
        ],
        "stock": 157,
        "reviews": "4.3 out of 5(96)"
    },
    {
        "title": "Captain Morgan Captain Morgan Gold Rum - 750ml",
        "slug": "captain-morgan-captain-morgan-gold-rum-750ml",
        "price_ksh": "KSh 999",
        "price": 7.7,
        "image": "products/8823.jpg",
        "brand": "Captain Morgan",
        "category": "Grocery",
        "description": "Captain MorganGoldis a delicious, smooth golden spirit with vanilla spice flavor. Smooth and medium bodied, Captain Morgan Original rum is made through a secret blend of Caribbean rums, mellow spice and other natural flavours. It gets its distinct richness and amber colour from ageing in charred white oak barrels. Aged in oak, it has an unmistakable dark, full-bodied colour and distinctive rich taste.Buy online and get it delivered to your doorstep with this exclusive offer from Jumia.",
        "sku": ": CA020DR1573NUNAFAMZ",
        "specifications": {
            "SKU": ": CA020DR1573NUNAFAMZ",
            "Weight (kg)": ": 750ml",
            "Main Material": ": RUM",
            "Shop Type": ": Aliabba Retail/Food"
        },
        "images": [
            "products/8823_b.jpg",
            "products/8824_a.jpg"
        ],
        "stock": 150,
        "reviews": "4.7 out of 5(37)"
    },
    {
        "title": "Fashion Navy Blue/White/Red 3-Pack Round Neck Heavy Duty 180 GSM T-shirts",
        "slug": "fashion-navy-bluewhitered-3-pack-round-neck-heavy-duty-180-gsm-t-shirts",
        "price_ksh": "KSh 990 - KSh 1,199",
        "price": 76338.24,
        "image": "products/7125.jpg",
        "brand": "Fashion",
        "category": "Fashion",
        "description": "Revamp your casual collection with this t-shirt. Made fromcotton fabric, this t-shirt stays extremely soft against the skin. It  features a classic round neck, solid pattern and short sleeves giving it a bold structure. These casual T-shirts will give you the best look you desire. The 100% cotton crew neck is a premium product with a classic fit. Order yours today and have it delivered to your doorstep.",
        "sku": ": FA113MW2U4ACTNAFAMZ",
        "specifications": {
            "SKU": ": FA113MW2U4ACTNAFAMZ",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 1",
            "Main Material": ": Cotton",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [],
        "stock": 128,
        "reviews": "3.5 out of 5(47)"
    },
    {
        "title": "Fashion Men Shoes Loafers Casual Shoes Slip-On Shoes Business Shoes",
        "slug": "fashion-men-shoes-loafers-casual-shoes-slip-on-shoes-business-shoes",
        "price_ksh": "KSh 636 - KSh 699",
        "price": 4908.95,
        "image": "products/1960.jpg",
        "brand": "Fashion",
        "category": "Fashion",
        "description": "Welcome to SMARKDear customer, welcome to SMARK store. Thank you for your love for our products.SMARK focuses on African Fashion and is committed to providing you with better products, fashionable designs and higher quality services.We provide varieties of fashion products with diverse patterns and styles. Whether you are looking for fashion bags, shoes, or clothing, you can always find what you need in our store.This product you are currently browsing is fashionable, practical and cost-effective, making it to be a must-have one. At the same time, you can also click on the store name to enter our store and explore more fashionable surprises.Now, we will introduce more details of this product for you.Let's start your fashion journey at SMARK right now!Product DetailsUpper Material: ClothSole Material: SyntheticInner Material: PolyesterStyle: CasualCloser: Pull onHeel Type: Flat ShoesFeatures: Wear-resistant, Comfortable, BreathableNotice1. The product size is measured by hand, and there may be an error of 1-3 cm, which belongs to the normal range.2.  The same size of different products are different. There is asize chart in the product link, please choose the size that suits you according to the size chart, instead of your usual experience.3. During the shooting process of the product, due to the difference in light, there may be a slight color difference between the real object and the pictures, which is a normal phenomenon.4. The product may be squeezed during delivery. If the product you received is not as flat as it looks in the pictures, please don't worry. This is a normal phenomenon, and it will be fine after using for a while.5. The product will have some smell of the material itself when produced from the factory. This is normal for new products. Take the product out of the packaging and the smell will disappear in a few days.6. Please store in a ventilated and cool place. Do not place in damp places or expose to strong sunlight for a long time.About UsSMARK focuses on African Fashion and is committed to providing fashion products exclusive to African consumers. We have an independent designer team and many factories. Through investigating in African consumers and continuous updating our patterns and styles, we launched a series of high -quality fashion products, which are conform to the usage habits and fashion concepts of African consumers.At present, our products have been sold in more than 10 countries in Africa, winning a good reputation and earning highly favor from African consumers.Blindly following the trend is not fashion. By choosing our products, whether bags, shoes or clothing, you can always find your own fashion style. You are the trend itself and do not need to be defined.Providing products that satisfy consumers is our ultimate pursuit. Your satisfaction and positive feedback are of great significance to us. If you like our products, please give us a five-star rating, which will encourage us to continue providing high-quality products and services. If you have any questions during the purchasing process, feel free to contact us at anytime. We will do our best to solve your problem.Thank you again for choosing our product. Wishing you a pleasant shopping experience at SMARK!",
        "sku": ": FA113FS02K215NAFAMZ",
        "specifications": {
            "SKU": ": FA113FS02K215NAFAMZ",
            "Model": ": 牛筋底男乐福鞋-KE",
            "Weight (kg)": ": 0.3",
            "Main Material": ": Cloth"
        },
        "images": [
            "products/1960_b.jpg",
            "products/6652_a.jpg",
            "products/6652_c.jpg",
            "products/6652_e.jpg",
            "products/6652_g.jpg",
            "products/6652_i.jpg",
            "products/6652_k.jpg",
            "products/6652_m.jpg"
        ],
        "stock": 116,
        "reviews": "3.6 out of 5(255)"
    },
    {
        "title": "ASHION 2024 Men's Casual Shoes Big Size  Sneakers 39-48",
        "slug": "ashion-2024-mens-casual-shoes-big-size-sneakers-39-48",
        "price_ksh": "KSh 946",
        "price": 7.29,
        "image": "products/9726.jpg",
        "brand": "ASHION",
        "category": "Fashion",
        "description": "Recommended Products​DearCustomers, welcome to our store! We wish you all the best.If you keep up with fashion trends, pleaseFOLLOWour shop.ASHION  vsOther BrandsIntroducing the ASHION - the epitome of style & comfort.ASHION Canvas Sneakers - Stylish, comfortable, and versatile. High-quality canvas fabric for durability and breathability. Fashionable lace-up design with a comfortable thickened heel. Strong, non-slip rubber sole for all-day wear. Perfect for any casual outfit, all year round. Elevate your style with ASHION Canvas Sneakers.Our premium men's shoes is the perfect choice for those that demand the best.Size chartIn order to avoid choosing the wrong size, please check the size chart carefully .Tips1:If your foot breadth is wider than normal, I suggest you choose one size larger!!!Tips2:Please choose the size follow your Foot Length (1 cm=0.394 inch).------- Men Size (38-48)  -------Women Size(35-42)EU size 35 = 22.5cm (bare feet length) = 8.86 inchEU size 36 = 23.0cm (bare feet length) = 9.06 inchEU size 37 = 23.5cm (bare feet length) = 9.25 inchEU size 38 = 24.0cm (bare feet length) = 9.45 inchEU size 39 = 24.5cm (bare feet length) = 9.65 inchEU size 40 = 25.0cm (bare feet length) = 9.84 inchEU size 41 = 25.5cm (bare feet length) =10.04 inchEU size 42 = 26.0cm (bare feet length) =10.24 inchEU size 43 = 26.5cm (bare feet length) =10.43 inchEU size 44 = 27.0cm (bare feet length) =10.63 inchEU size 45 = 27.5cm (bare feet length) =10.83 inchEU size 46 = 28.0cm (bare feet length) =11.02 inchEU size 47 = 28.5cm (bare feet length) =11.22 inchEU size 48 = 29.0cm (bare feet length) =11.42 inchUpper featuresSelect high-quality fabrics, flexible texture, strong breathability; Soft and light, comfortable to wear and available in a variety of colors.Line designThe large area of the upper is sewn with lines to stabilize the upper and enhance flexibility; the smooth and orderly lines enhance the appearance of the shoes, which are beautiful and generous.Inside featuresBreathable lining to keep your feet dry and comfortable; Don't be afraid of problems such as stuffy feet and sweaty feet caused by long-distance walking.Rubber soleThe rubber outsole has good ductility, softness and elasticity; the anti-slip texture design of the sole effectively enhances the friction force and allows you to move forward calmly.Care & Our ServiceSpot clean with a mixture of warm water and gentle soap or detergent. We stick to pay attention to product quality, if there's any quality problems please feel free to contact us.ASHION ServiceSafe Shopping Guarantee.Easy Return within 15 days.7 days * 24 hours Customer Service.Jumia Express, Quickest delivery.",
        "sku": ": FA113FS2ANURDNAFAMZ",
        "specifications": {
            "SKU": ": FA113FS2ANURDNAFAMZ",
            "Model": ": S63",
            "Production Country": ": China",
            "Size (L x W x H cm)": ": 30 x 20 x 15",
            "Weight (kg)": ": 0.6",
            "Main Material": ": Canvas",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/9726_b.jpg",
            "products/8913_a.jpg",
            "products/5285_a.jpg",
            "products/5285_c.jpg",
            "products/5285_e.jpg",
            "products/5285_g.jpg",
            "products/5285_i.jpg",
            "products/5285_k.jpg"
        ],
        "stock": 109,
        "reviews": "4.1 out of 5(257)"
    },
    {
        "title": "Roch RFR-120S-I Single Door Refrigerator - 90 Litres - Silver (1Y WRTY)",
        "slug": "roch-rfr-120s-i-single-door-refrigerator-90-litres-silver-1y-wrty",
        "price_ksh": "KSh 17,050",
        "price": 131.46,
        "image": "products/9518.jpg",
        "brand": "Roch",
        "category": "Home & Office",
        "description": "​​Roch RFR-120S-I 90L Single Door Fridge is a_sleek and stylish exterior gets you that practical functionality in a pleasing design an ideal fit for your modern kitchen.The Roch fridge has a 90-liter storage capacity and impressive cooling performance to extend the freshness of your perishable goods. The single door configuration is also great for reducing the amount of cold air lost from opening. Roch's smart technology provides consistent cold air distribution throughout each of the fridge's compartments, helping to maintain the perfect temperature. BuyRoch RFR-120S-I  90LSingle Door Fridgeonline at Jumia United Kingdom and it will be delivered to you.FeaturesMechanical controlInterior LED lightEnergy-saving and low noiseAdjustable front feetLock & keyProduct(mm) : 450*490*831Volume (L): 90",
        "sku": ": RO745HA2QO5V8NAFAMZ",
        "specifications": {
            "SKU": ": RO745HA2QO5V8NAFAMZ",
            "Model": ": RFR-120S-I",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 22",
            "Main Material": ": -"
        },
        "images": [
            "products/9518_b.jpg",
            "products/9518_d.jpg",
            "products/9518_f.jpg"
        ],
        "stock": 94,
        "reviews": "4.2 out of 5(459)"
    },
    {
        "title": "RichRipple Aluminum Alloy Portable Laptop Stand Adjustable Height Foldable Computer Stand",
        "slug": "richripple-aluminum-alloy-portable-laptop-stand-adjustable-height-foldable-computer-stand",
        "price_ksh": "KSh 479",
        "price": 3.69,
        "image": "products/3966.jpg",
        "brand": "RichRipple",
        "category": "Computing",
        "description": "RichRipple PortableAluminumLaptop Bracket6-hole Height-adjustable FoldableLaptop Tablet Bracket Supports All Laptop ipads.Features:1. Aluminum alloy material, maximum load-bearing 40kg, anti-thickness reinforcement, detachable mobile phone bracket, sturdy and durable.2. Adjust the height at will during use, choose the height most suitable for your use, and improve work efficiency.3. Independent packaging design, dust-proof bag inside, light and convenient, portable and foldable design, easy to operate, small size after folding, small footprint, can be used at home or at work, travel or shopping.4. Hollow scientific design: The bracket adopts aluminum alloy material + bottom hollow design, which is easy to dissipate heat during use, protecting your beloved laptop from the adverse effects of hardware and CPU overheating, and extending the life of the computer.5. Compatibility: This laptop stand is suitable for most devices from 9-15.6in inches. Ergonomically designed for easy viewing and typing, reducing neck, shoulder and spine pain.6. Scientific triangular design: 6 holes can adjust the height to ensure the stability and firmness of the product during use, and support the computer.Specifications:Material: Metal+SiliconeColor: SilverAdjustable levels: 6 levelsLaptop size: 9-15.6in inch6 Heights adjustable range: from 5.5cm to 15.5cmMaterial: Aluminum Alloy + Silica GelProduct use range: suitable for notebooks, tablet computers, booksPackage Included:1 x Metal notebook bracket1 x Storage bagNote:1. Due to manual measurement, please allow 1-3cm error. Make sure you don't mind before bidding.2. Due to the difference of different monitors, the picture may not reflect the actual color of the product.  Thanks.",
        "sku": ": RI225EA2BQFCVNAFAMZ",
        "specifications": {
            "SKU": ": RI225EA2BQFCVNAFAMZ",
            "Model": ": Aluminum Portable Laptop Stand 6-hole Adjustable Height Foldable Laptop Stand",
            "Weight (kg)": ": 0.1",
            "Main Material": ": Waterproof"
        },
        "images": [
            "products/3966_b.jpg",
            "products/0352_a.jpg",
            "products/0352_c.jpg",
            "products/0352_e.jpg",
            "products/0352_g.jpg",
            "products/0352_i.jpg",
            "products/0352_k.jpg",
            "products/7039_a.jpg"
        ],
        "stock": 44,
        "reviews": "4.5 out of 5(307)"
    },
    {
        "title": "Machislet Fashion High Quality Elegant Clothes Printed Dress Halter For Summer",
        "slug": "machislet-fashion-high-quality-elegant-clothes-printed-dress-halter-for-summer",
        "price_ksh": "KSh 650 - KSh 714",
        "price": 5017.0,
        "image": "products/7358.jpg",
        "brand": "Machislet",
        "category": "Fashion",
        "description": "Connues comme la reine de la mode dans de nombreux styles, les robes sont les plus imprévisibles, les plus populaires et les plus populaires. La robe est un terme général pour une variété, et c'est l'une des robes d'été de choix pour les jeunes filles.Les manches longues à une épaule sont la beauté unique de cette robe, et l'imprimé d'ondulation de l'eau est sauvage et indubitable. Il a une bonne élasticité et peut maximiser votre silhouette.Il crée une taille plus définie et est un style hip-pack élégant. Si vous voulez fa?onner les courbes, cette robe est un bon choix.La correspondance des couleurs vives et sans retenue de cette robe est la combinaison parfaite de sexy et d'intellectuel, et c'est un choix que vous ne regretterez pas !AvisA. En raison de la différence entre l'affichage et la lumière du téléphone portable, la couleur réelle peut être légèrement différente de l'image.B. En raison de la mesure manuelle, veuillez permettre une erreur de mesure de 1 à 3 cm.C. Le produit lui-même est fait de matériaux respectueux de l'environnement, s?rs et confortables à utiliser, soyez assuré de l'utiliser.D. Merci de votre compréhension et bienvenue pour acheter nos produits.Histoire d'usine Nous nous engageons à fournir des produits de première nécessité pratiques, à la mode et abordables dans de nombreux pays du monde. à l'heure actuelle, nos produits ont été vendus dans plus de 70 pays à travers le monde. De plus, nous sommes une usine source qui fournit directement des produits pour les grandes marques. Pour un même produit, le prix que vous achetez directementde notre usine sera certainement bien inférieur au prix que vous achetez auprès d'une grande marque, ce qui vous profite pour obtenir des produits de même qualité et tendance à un prix bien inférieur à ceux des grandes marques . Nous espérons que nos produits de haute qualité peuvent enrichir votre vie, résoudre de nombreux problèmes que vous rencontrez et rendre votre vie plus colorée. Vous êtes invités à choisir nos produits, et nous travaillerons dur pour rendre votre vie plus pratique et plus heureuse.",
        "sku": ": FA113MW39K5WPNAFAMZ",
        "specifications": {
            "SKU": ": FA113MW39K5WPNAFAMZ",
            "Model": ": High Quality Elegant Clothes Printed Dress Halter For Summer",
            "Weight (kg)": ": 0.2",
            "Main Material": ": Coton"
        },
        "images": [
            "products/7358_b.jpg",
            "products/2724_a.jpg",
            "products/2724_c.jpg"
        ],
        "stock": 157,
        "reviews": "4.3 out of 5(51)"
    },
    {
        "title": "2PCs Sexy Strappy Ice Silk Seamless Ladies Panties",
        "slug": "2pcs-sexy-strappy-ice-silk-seamless-ladies-panties",
        "price_ksh": "KSh 699",
        "price": 5.39,
        "image": "products/5372.jpg",
        "brand": "Generic",
        "category": "Fashion",
        "description": "juice up your beautiful curves with ourhottesthipster lace panties. Most gorgeous shades at the edges giving your curves the most perfect hug that feels just right. Covers the whole booty.PureCottonfabric at the inner part to absorb excess inbuilt heat and sweat helping you to prevent the common yeast infections. Made ofseamlessedges to avoid embarrassing panty marks from being visible giving you freedom to wear it with any type of cloth.Super comfythat feels like your skin with an epic comfort experience to the.maximum. Available in the coolest colors with The most perfect GUARANTEED qualitySIZE GuideM/L-Hips 36-41inchesXL/XXL-Hips 42-46",
        "sku": ": GE840SL1Q1L1GNAFAMZ",
        "specifications": {
            "SKU": ": GE840SL1Q1L1GNAFAMZ",
            "Weight (kg)": ": 0.02"
        },
        "images": [
            "products/5372_b.jpg",
            "products/0963_a.jpg"
        ],
        "stock": 176,
        "reviews": "4.1 out of 5(148)"
    },
    {
        "title": "Amtec 43L12, 43\" FHD Smart Android TV, Netfix, Youtube, Bluetooth - Black (1YR WRTY)",
        "slug": "amtec-43l12-43-fhd-smart-android-tv-netfix-youtube-bluetooth-black-1yr-wrty",
        "price_ksh": "KSh 18,799",
        "price": 144.94,
        "image": "products/4796.jpg",
        "brand": "Amtec",
        "category": "Electronics",
        "description": "ThisAmtec 43\" 43L12 Smart Android Full HDLED TV is slimmer & incorporates great aesthetic design. AccessNetflix , YouTube,  Facebook, google playand many more Apps .It looks beautiful from any angle and fits perfectly into your living room. Enjoy its vivid picture and dynamic sound in 1080p Full HD resolution. Full HD High Brightness Series Display, provide easily readable text and bright graphics in high ambient light environments and outdoor applications.Energy SavingThe Energy Saving feature  adjusts the brightness of your TV to reduce Power Consumption. It can also help to reduce eye fatigue, especially in a dimly lit room. You can access movie, music, and photo files directly from a memory unit through the USB connection. This model features 3 HDMI inputs for connecting high definition devices and 2 USB inputs for external storage accessories such as USB flash drives and HDDs.ECO-FRIENDLYThis TV will allow you to see images in sharp and crystal clear form. With a high resolution, you will be able to see colors in their true form. This will make you have an enjoyable TV experience, entertainment gets better when you have a very good television. If you are a lover of sport and action movies that involve a lot of fast-moving pictures then this LED TV is the right choice.High Quality DisplayAmtec  TVs are known for their high quality displays, and the AMTEC 43 SMART TV  is no exception. Amtec advanced picture  Wide Color Enhancer Plus, makes any image better and uncovers hidden details on your video, thus you see more brilliant colors on the screen.Technical SpecificationsDisplayBacklight System: LEDScreen size: 43\"Connectivity2 HDMI ports2 USB portsBluetoothEthernetAdditional FeaturesEnergy SavingEco friendlySlim Bezel.FEATURESSMART AndroidSmart TV with inbuilt Wi-FIInbuilt AppsNetflix, YouTubeGoogle Play storeLed displayCrystal slim designHDMI USB AV INPUTBluetooth EnabledEthernet port",
        "sku": ": AM617EA1K3NOJNAFAMZ",
        "specifications": {
            "SKU": ": AM617EA1K3NOJNAFAMZ",
            "Model": ": 43L12",
            "Size (L x W x H cm)": ": 101.5*13.0*61.5",
            "Weight (kg)": ": 8.6",
            "Main Material": ": PVC",
            "From the Manufacturer": ": <font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\"><font style=\"vertical-align: inherit;\">​</font></font></font></font></font></font>",
            "Care Label": ": <p><strong>FRAGILE HANDLE WITH CARE.</strong></p>",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/4796_b.jpg",
            "products/4797_a.jpg"
        ],
        "stock": 70,
        "reviews": "4.1 out of 5(271)"
    },
    {
        "title": "Fashion Men's Long Sleeve Striped Shirt",
        "slug": "fashion-mens-long-sleeve-striped-shirt",
        "price_ksh": "KSh 545 - KSh 599",
        "price": 4206.57,
        "image": "products/8144.jpg",
        "brand": "Fashion",
        "category": "Fashion",
        "description": "★More Product recommendations★Material: cotton, polyesterSleeve: long sleeve\n\nPacking list：1*dress shirts",
        "sku": ": FA113MW2JBOX5NAFAMZ",
        "specifications": {
            "SKU": ": FA113MW2JBOX5NAFAMZ",
            "Model": ": YU-17030L-Grey",
            "Weight (kg)": ": 0.5",
            "Care Label": ": N/A",
            "Shop Type": ": Aliabba Retail"
        },
        "images": [
            "products/8144_b.jpg",
            "products/8015_a.jpg"
        ],
        "stock": 104,
        "reviews": "3.9 out of 5(113)"
    },
    {
        "title": "Fashion Hard Khaki Trouser Pants -Brown",
        "slug": "fashion-hard-khaki-trouser-pants-brown",
        "price_ksh": "KSh 960 - KSh 1,049",
        "price": 74024.09,
        "image": "products/8167.jpg",
        "brand": "Fashion",
        "category": "Fashion",
        "description": "khakis have become a staple in men's wardrobes. Thiskhaki pantsare made ofcotton. They are also wrinkle-resistant so you won't have to spend time ironing them out.  They are also treated to resist fading so you will be wearing them for a long time. The have a slim-fit cut so they will be snug but not tight. You will appreciate the exquisite craftsmanship and  excellent finishing like the button, smooth metal zip for closure and belt loops design for waist adjustment. This stylish pants work perfectly both for the office and casual days. You can wear it with a formal shirt or wear with a casual  shirt or t-shirt to enhance a casual look to smart casual. Get it at your door step via jumia.",
        "sku": ": FA113MW22LNQPNAFAMZ",
        "specifications": {
            "SKU": ": FA113MW22LNQPNAFAMZ",
            "Weight (kg)": ": 0.3",
            "Main Material": ": Cotton"
        },
        "images": [
            "products/8167_b.jpg",
            "products/8167_d.jpg"
        ],
        "stock": 196,
        "reviews": "4 out of 5(9)"
    },
    {
        "title": "Binatone SI-1850 Smoother Gliding Steam Iron - 1800W - White/Purple",
        "slug": "binatone-si-1850-smoother-gliding-steam-iron-1800w-whitepurple",
        "price_ksh": "KSh 1,959",
        "price": 15.1,
        "image": "products/1005.jpg",
        "brand": "Binatone",
        "category": "Home & Office",
        "description": "The quintessential Binatone smooth gliding steam iron is facilitated with an ability of quickened heat up and high steam output. Apart from continuous and manageable steam capacity, the iron is also equipped with a smart light spray facility in order to make it easier for ironing over a moisturized surface. Also, it comes with a water measuring cup and an overheat safety protection unit in order to minimize any attendant risks involved. Also, the iron is equipped with a steam boost option in order to straighten out the toughest of creases, and a variable temperature facility. Order for thisSI-1850 team Iron online from JumiaUnited Kingdom and have it delivered to your doorstep.FeaturesSuper glide non-stick soleplateFast heat-up and constant high steam outputOverheat safety protection circuitContinuous and adjustable steamStrong steam boost for stubborn crease removalVariable temperature settingFine water spray evenly moistens the fabric for easy ironingVoltage:220-240V~50/60HzPower:1800W",
        "sku": ": BI162HA37SO5KNAFAMZ",
        "specifications": {
            "SKU": ": BI162HA37SO5KNAFAMZ",
            "GTIN Barcode": ": 4893114215943",
            "Model": ": SI-1850",
            "Size (L x W x H cm)": ": -",
            "Weight (kg)": ": 0.5",
            "Main Material": ": -"
        },
        "images": [
            "products/1005_b.jpg",
            "products/1005_d.jpg",
            "products/1005_f.jpg"
        ],
        "stock": 98,
        "reviews": "4.6 out of 5(55)"
    }
]